fonecmid-diplom/src/Documents/ГрафикОтпусков/ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ОстаткиОтпусковСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонца</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ОстаткиОтпусковСотрудников/ОстаткиОтпусковСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиОтпусковСотрудников</name>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ГрафикОтпусков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиОтпусковСотрудников.Очистить();
	Движения.ОстаткиОтпусковСотрудников.Записывать = Истина;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.ДатаНачала = '00010101' 
			ИЛИ Строка.ДатаКонца = '00010101' Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.ДатаКонца < Строка.ДатаНачала Тогда
			Продолжить;
		КонецЕсли;
		
		РазницаВСекундах = Строка.ДатаКонца - Строка.ДатаНачала;
		КоличествоДней = РазницаВСекундах / 86400 + 1;
		Если КоличествоДней <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ОстаткиОтпусковСотрудников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Строка.ДатаНачала;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.КоличествоДней = КоличествоДней;
		
	КонецЦикла;
	
КонецПроцедуры
